import socket
import os
import random
import matplotlib.pyplot as plt
from matplotlib.animation import FuncAnimation
import threading

# === LIVE GRAPH DATA ===
#פה רושמים את המידע שצריך להצטייר בגרף
live_window = []

# === SERVER SETTINGS ===
SERVER_IP = "127.0.0.1"
SERVER_PORT = 1234
#זה המיקום שממנו שולפים את המידע
FILE_DIR = r"C:\Users\oranm\AppData\Local\Programs\Python\Python313\python\Almog\files"

#גודל פקטה נורמטיבי , גדול מידי לא היה מצליח לעבור לכן חילקנו לכמות קטנה
PACKET_SIZE = 8192
TIMEOUT = 0.4          # זמן המתנה התחלתי ל-ACK
THRESHOLD = 8          # ssthresh התחלתי

#יוצרים פקטה -פרמטרים של מספר סדרה והמדיע עצמו
#מחזירים מספר הסדרתי של פקטה כולל המרה לביטים בנוסף למידע עצמו
def make_packet(seq, data):
    return f"{seq}|".encode() + data

# === GRAPH ===
#גרף חי 
def live_plot():
    #סוג מסוים של עיצוב שנקרקא ggplot
    plt.style.use("ggplot")
    #לוקחים פונקציה ספציפית מplt ואת הערכים של הפונקציה מכניסים למשתנים שיצרנו fig,ax
    #fig = כל החלון/המסך שבו הגרף מוצג
    #ax = אזור הציור בתוך החלון (הצירים עצמם)

    fig, ax = plt.subplots()
    #ax פירושו צירים fig הוא אזור המסגרת . כתבנו אילו כותרות יופיעו בגרף והיכן
    ax.set_title("RUDP Congestion Window (LIVE)")
    ax.set_xlabel("Update ")
    ax.set_ylabel("Window Size")
    #מאמתים שלא לחצנו על רווח ואז הגרף לא נעצר כדי שנוכל לעדכן אותו אחרת הפונקציה נעצרת
    is_paused = False
    #לפי מספר הפעמים של עדכון כך נשלח מספר פרמטר לפונקציה
    def update(_):
        #בודקים כנ"ל שלא לחצו על רווח אחרת הפונקציה נעצרת
        if is_paused:
            return
        #כל פעם שיש שינוי בגרף מנקים אותו ומציירים אותו מחדש בתוספת של הערך החדש . קורה מהר ולא רואים עושים כדי להימנע מכפילויות ושכבות שיצרו עומס
        ax.clear()
        #פונקציה שמציירת קו גרפי על הצירים את הנתונים תיקח מlive window , כל ערך שמופיע ברשימה תסמן בעיגול ,ניתן לבחור רק סימנים מוגדרים מקובלים בספריה 
        ax.plot(live_window, marker='o')
        ax.set_title("RUDP Congestion Window (LIVE)")
        ax.set_xlabel("Update ")
        ax.set_ylabel("Window Size")

    #לולאה שגורמת לupdate לפעול שוב ושוב . אנו שומרים אותה במשתנה anim אחרת לא הייתה חוזרת . משתמשים בפונקציה מספריה ושמים בה פרמטרים fig למיקום שבו עורכים שינויים ,update איזו פונקציה להפעיל שוב ושוב, כל כמה זמן להפעיל מחדש , והאם יש צורך לשמור את האנימציה 
    anim = FuncAnimation(fig, update, interval=300, cache_frame_data=False)


    #מתג השהייה
    def toggle_pause(event):
        #כאשר רוצים לשנות את ערך המשתנה ולא רק לקרוא לו
        nonlocal is_paused
        #אני צריך לבדוק את ה event  שאני מקבל לבד אם הוא רווח מהפך את הדגל
      
        if event.key == " ":
            is_paused = not is_paused
            if is_paused:
                anim.event_source.stop()
            else:
                anim.event_source.start()
                
                
    #הרווח פועל רק כשאני בחלון הגרף לכן הקוד אומר כשהחלון פתוח באזור הגרף האזן האם נלחץ  מקש כלשהו ובהתאם הפעל פונקציה של מתג השהייה
    fig.canvas.mpl_connect("key_press_event", toggle_pause)
    #להציג את הגרף .show מתודה בתוך plt
    plt.show()

#זו הפונקציה שמריצה את השרת 
def run_server():
    global THRESHOLD, TIMEOUT
    #שורה זו יוצרת שרת UDP
    sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
    #מקשרים בין הsock ואומרים לו תיקח מידע ממה שבסוגריים פה 
    sock.bind((SERVER_IP, SERVER_PORT))
    sock.settimeout(None)       # ממתינים ללקוח בלי timeout
    print(f"SERVER READY on {SERVER_IP}:{SERVER_PORT}\n")

    while True:
        #נצרך . מנגנון שדואג להריץ קוד שעלול להכיל שגיאה בלי קריסת התוכנית
        try:
            print("Waiting for client request...")
            #recvfrom היא מתודה של sock והיא תמלא את המשתנים request,client בהתאמה מה הבקשה של הלקוח ומה הכתובת שלו.המספר בסוגרים הוא כמות הבייטים המוגבלת להודעה אחת בשרת
            request, client = sock.recvfrom(65536)
            #יצרנו שם משתנה של הקובץ להמשך הקוד,אנחנו משיגים את שמו ממירים אותו מבייטים לאותיות ומורידים רווחים
            filename = request.decode().strip()
            print(f"Client requested: {filename}")

            # === בחירת איבוד פקטות ב-Download הזה בלבד ===
            #לפני סימולציה אין איבוד נתונים בדגל ובררת המחדל היא 0 
            SIMULATE_LOSS = False
            LOSS_PERCENTAGE = 0
            #מטפלים בקבלה מהמשתמש
            choice = input("Simulate packet loss? (y/n): ").strip().lower()
            if choice == "y":
                SIMULATE_LOSS = True
                while True:
                    try:
                        LOSS_PERCENTAGE = int(input("Loss percentage (0-100): ").strip())
                        if 0 <= LOSS_PERCENTAGE <= 100:
                            #יוצאים מהלולאה האינסופית
                            break
                    #עובד עם try במידה ויש שגיאה באינפוט except מטפל במצב של בעיה ולא גורם למערכת לקרוס
                    except:
                        #     תדלג לבנתיים כאילו לא קרה דבר-אין פעולה לעשות כרגעבאזור זה 
                        pass
                #חוזרים למעלה מדפיסים מה המצב כמה הוא ביקש לאבד ומבקשים אינפוט מחדש
                print(f"Packet loss simulation ON → {LOSS_PERCENTAGE}%\n")
            else:
                #מדפיסים שלא מעוניין באיבוד פקטות
                print("Packet loss simulation OFF\n")


            # === בדיקת קובץ ===
            #FILE DIR מיקום הקבצים . filename שם הקובץ שהמשתמש ביקש . אנחנו מאחדים אותם שיתאים לכל מערכת הפעלה ומחזיר True אם קיים  
            path = os.path.join(FILE_DIR, filename)
            #אם הקובץ לא קיים  
            if not os.path.exists(path):
                #שולחים ללקוח 404 וכו'
                sock.sendto(b"NOT FOUND 404", client)
                #ואילו בשרת כותבים כך 
                print("FILE NOT FOUND:", filename)
                #חוזרים לתחילת הלולאה
                continue
            
            #שולחים למשתמש OK מומר לבייטים בגלל זה ה b
            sock.sendto(b"OK", client)
            
            #משתמשים בopen לפתוח את הקובץ שנמצא בpath מתוך מחשבה להמיר אותו בהמשך לבייטים ("rb") מגדירים אותו כf ודואגים שברגע שסיימנו את הפעולה סוגרים את הקובץ שפתחתנו על ידי with . ממירים את הקובץ וקוראים אותו על ידי read
            with open(path, "rb") as f:
                data = f.read()
                
            #List Comprehension.יוצרים רשימה שבה חותכים את data לגודל של פקטות
            packets = [data[i:i + PACKET_SIZE] for i in range(0, len(data), PACKET_SIZE)]
            #בהתחלה שולחים פקטה אחת ללקוח לא לגרום עומס . בהמשך מעלים
            window = 1
            #מגדירים שהפקטה הראשונית שלא קיבלה ACK היא 0
            base = 0
            #הפקטה הבאה לשלוח היא מספר 0 .פקטות נספרות כמו אינדקסים
            next_seq = 0
            #מגידירים שהערכים של acked יהיו במבנה של set
            acked = set()
            #כל שינוי בכמות הפקטות ששולחים ללקוח מופיע בlive window שהיא רשימה
            live_window.append(window)    
            #מדפיסים שמתחילים הערבה ויש כך וכך פקטות
            print(f"Starting RUDP transfer ({len(packets)} packets)...")
            # משתמשים ב-timeout רק אם המשתמש הכריז שהוא מאבד פקטות במדיה ולא אין הגבלת זמן לACK.כאשר עובר הזמן מורידים עומס window,THRESHOLD
            if SIMULATE_LOSS:
                sock.settimeout(TIMEOUT)
            else:
                sock.settimeout(None)
            #סופרים כמה פעמים עבר הSETTIMEOUT
            retry_count = 0
            MAX_RETRIES = 20  # כמה ניסיונות לפני שמתייאשים
            #כל עוד מספר הפקטה שלא קיבלתי עליו ACK קטן ממספר הפקטות תישאר בלולאה
            while base < len(packets):
                # עוברת על איזה מספר פקטה צריך לשלוח עכשיו מתחילים בםקטה הבאה לשליחה ועוצרים במה שיותר מינימלי מספר הפקטות או גודל ההרחבה של כמות פקטות לפי גודל חלון
                for seq in range(next_seq, min(base + window, len(packets))):
                    
                    # סימולציה: לא משדרים חלק מהפקטות
                    #לפני ששולחים את הפקטה עושים הגרלה במידה ואישר איבוד פקטות אם המספר יוצא קטן מהאחוז שציין המשתמש הפקטה תאבד
                    if SIMULATE_LOSS and random.randint(1, 100) <= LOSS_PERCENTAGE:
                        #מודפס איבוד פקטה מספר במקום לשלוח אותה 
                        print(f"⚠ Lost seq={seq}")
                        #חוזרים לתחילת הלולאה וממשיכים לפקטה הבאה למרות זו שאבדה
                        continue
                    #send to פונקציה של sock ב UDP יוצרים פקטה על ידי מספר הפקטה והפקטה עצמה ושולחים אותה ללקוח
                    sock.sendto(make_packet(seq, packets[seq]), client)
                    #מספר הפקטה שנשלחה עכשיו,כמות הפקטות  שהשרת מרשה לעצמו לשלוח בו זמנית בלי צורך בACK
                    print(f"📤 Sent seq={seq} window={window}")
                #מספר הפקטה שתשלח בחלון הבא .המינימום בין המספר של כמות הפקטות לבין גודל הפקטות שהשרת שולח בו זמנית והפקטה הראשוניתת שלא קיבלה ACK
                next_seq = min(base + window, len(packets))
                #שלא יקרוס...
                try:
                    #השרת עוצר וממתין להודעה מהלקוח, ההודעה יכולה להיו במשקל מקסימלי של 65536 .הפונקציה recvfrom של sock ממתתינה ומקבלת את הכתובת של הלקוח שלא רלוונטית ומיוצגת ב_ ואת ההודעה של הלקוח שהיא ACK
                    ack_raw, _ = sock.recvfrom(65536)
                    #ממירים את הבייטים החשמליים לטקסט ואז מספר
                    ack = int(ack_raw.decode())
                    print(f"📥 ACK={ack}")
                    #אם ack לא נמצא ברשימת set של acked -תוסיף לרשימה
                    if ack not in acked:
                        acked.add(ack)
                        retry_count = 0  # קיבלנו ACK → מאפסים נסיונות
                        #אם קיבלנו ACK שהוא אותו מספר של הפקטה האחרונה שקיבלה ACK 
                        if ack == base:
                            #בודק אם המספר של הפקטה האחרונה שקיבלנו עליה ACK נמצאת ברשימה וכל עוד הצורה רציפה הוא מוסיף אחד כל פעם 
                            while base in acked:
                                base += 1

                        # גידול חלון - slow start ואז AIMD
                        #אם כמות הפקטות שהשרת מרשה לעצמו לשלוח בו זמנית בלי להמתין לACK קטן מ THRESHOLD תכפיל פי 2 אחרת תגדיל ב1 . הכל תציג בגרף
                        if window < THRESHOLD:
                            window *= 2
                        else:
                            window += 1
                        live_window.append(window)

                        # אם TIMEOUT גדל בעבר, אפשר בעדינות להקטין קצת
                        #בהמשך הגדלנו את הTIMEOUT במידה ולא הגיעו ACKים במידה והלקוח ביקש לאבד פקטות והזמן גדל מורידים את  "SETTIME" ב20 אחוז או ל
                        #0.4 תלוי מה יותר גדול  
                        if SIMULATE_LOSS and TIMEOUT > 0.4:
                            TIMEOUT = max(0.4, TIMEOUT * 0.8)
                            sock.settimeout(TIMEOUT)
                #במקרה ועבר הזמן TIMEOUT או שהחיבור לצד השני קרס אל תקרוס את השרת אלא תעשה ככה:
                except (socket.timeout, ConnectionResetError):
                    #מעלים ב1 את מספר הנסיונות
                    retry_count += 1
                    #הדפסה של כמות הנסינות ,סיבת התקלה,הפקטה שהלקוח מצפה לACK שלה וכמות הפקטות שהשרת מרשה לעצמו לשלוח בלי לקבל ACK
                    print(f"⏱ TIMEOUT/RESET! retry={retry_count}, base={base}, window={window}")
                    #בגלל התקלה בוחרים בגבוה מבין השתיים ב1 או בגודל של מה שהשרת מרשה לעצמו חלקי 2 . קובעים שמה שהשרת ירשה לעצמו הוא 1 .הפקטה הבאה היא הפקטה האחרונה שלא קיבלה ACK ומציגים את שינוי הWINDOW בגקף
                    THRESHOLD = max(1, window // 2)
                    window = 1
                    next_seq = base
                    live_window.append(window)

                    #אם הלקוח ביקש לאבד פקטות מגדילים את הזמן או פי 2 או ל5 הקטן שבניהם.מגדירים אותו מחדש ומדפיסים בגלל שאנחנו עושים ניתוקים ומעמיסים על השרת נותנים לו יותר זמן ,מה שלא נצרך במידה וביקש לא לאבד פקטות
                    if SIMULATE_LOSS:
                        TIMEOUT = min(TIMEOUT * 2, 5.0)
                        sock.settimeout(TIMEOUT)
                        print(f"⌛ New TIMEOUT = {TIMEOUT:.2f} sec")
                    #יותר מ20 נסיונות מדפיס כשלון ומפסיק קוד אחרת השרת יתקע לנצח .
                    if retry_count >= MAX_RETRIES:
                        print("⚠ Too many retries, aborting this transfer.")
                        break

            # סיום העברה (או ביטול)
            sock.settimeout(None)       # מחזירים מצב רגיל אין הגבלת זמן
            #במידה והפקטה הבאה שלא קיבלה ACK מספרה גדול או שווה למספר הפקטות אז תדפיס בבייטים ללקוח ותדפיס בנפרד בשרת
            if base >= len(packets):
                sock.sendto(b"DONE", client)
                print("🎉 Transfer complete!\n")
            #כיוון שהעברה נכשלה מודיעים ללקוח הודעה שידע שהתהליך נגמר ובשרת הודעה נוספת
            else:
                sock.sendto(b"DONE", client)
                print("⚠ Transfer aborted (not all packets delivered).\n")

            # ==== RESET SAFE STATE לכל הורדה חדשה ====
            THRESHOLD = 8
            TIMEOUT = 0.4
            live_window.append(1)       # מסמן התחלה חדשה בגרף
        #מהtry הראשון מגדירים כל תקלה כe ומדפיסים בהתאם
        except Exception as e:
            print("ERROR:", e)
#כאשר מפעילים את השרת ישירות ולא על ידי ייבוא .הקוים התחתונים הם סמל לשמות פנימיים בשפה 
if __name__ == "__main__":
    #השרת והגרף צריכים לרוץ בלי סוף במקביל לכן משמתמשים בthread אחרת הקוד יתקע בהם בלי הפסקה ולא ניתן להמשיך בקוד. החלק הבוליאני אומר שאם אחד מפסיק השני יפסיק איתו
    server_thread = threading.Thread(target=run_server, daemon=True)
    #כעת השרת רץ בלי סוף במקביל 
    server_thread.start()
    #מריצים את הגרף פייתון ידלג על הקטע של השרת ויצמד לגרף ובמקביל יעשה את השרת באופן אין בופי
    live_plot()


#python server.py



